Revit 2024 API
SpecUtils.IsValidDataType Method
 Returns true if the given ForgeTypeId identifies a valid parameter data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool IsValidDataType(
	ForgeTypeId dataType
)
Visual Basic
Public Shared Function IsValidDataType ( _
	dataType As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsValidDataType(
	ForgeTypeId^ dataType
)
Parameters
dataType
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier to check.
Return Value
 True if the ForgeTypeId identifies either a spec or a category, false otherwise.
Remarks
 A ForgeTypeId is acceptable as a parameter data type if it identifies either a spec or a category. When a category identifier is used as a parameter data type, it indicates a Family Type parameter of that category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpecUtils Class
Autodesk.Revit.DB Namespace